import sys

numbers = [
    ["   **   ", "    *   ", "   **   ", " ****** ", "     *  ", " ****** ", "  ******* ", " ****** ", " ******** ", " ******** "],
    ["  *  *  ", "   **   ", "  *  *  ", "     *  ", "    **  ", " *     *", " *        ", " *    * ", " *      * ", " *      * "], 
    [" *    * ", " *  *   ", " *   *  ", "    *   ", "   * *  ", " *      ", " *        ", "     *  ", " *      * ", " *      * "], 
    [" *    * ", "    *   ", "   *    ", "   *    ", "  ****  ", " ****** ", " ******** ", "    *   ", " ******** ", " ******** "],
    [" *    * ", "    *   ", "  *     ", "    *   ", "     *  ", "      * ", " *      * ", " *****  ", " *      * ", "        * "],
    ["  *  *  ", "    *   ", " *     *", "     *  ", "     *  ", " *    * ", " *      * ", " *      ", " *      * ", "        * "],
    ["   **   ", "   ***  ", " ****** ", " ****** ", "     *  ", " ****** ", " ******** ", "*       ", " ******** ", " *******  " ]
]

try:
    digits = sys.argv[1]
    for row in range(len(numbers)):
        output = ""
        for j in range(len(digits)):
            col = int(digits[j])
            output += numbers[row][col]
        print(output)
except IndexError:
    print("Программаға аргумент беру керек")
except ValueError:
    print("Бүтін сан болуы керек")

